Revit 2027 API
BuiltInFailures.GeneralFailures.EnterNonNegativeValue Property
 Enter a non-negative value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId EnterNonNegativeValue { get; }
Public Shared ReadOnly Property EnterNonNegativeValue As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ EnterNonNegativeValue {
	FailureDefinitionId^ get ();
}
static member EnterNonNegativeValue : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace